st = "АлексейДокажите, что энтропия монетки принимает наибольшее значение для правильной монетки.Рыболовлев"
st = st.lower()
letters = dict()
for elem in st:
    if elem.isalpha():
        if elem in letters:
            letters[elem] += 1
        else:
            letters[elem] = 1
keys = sorted(letters, key=lambda x: letters[x])
print(letters)
code = {'с': '0000000', 'ж': '0000001', 'э': '0000010', 'ш': '0000011', 'з': '0000100', 'ы': '0000101', 'й': '000011', 'д': '000100', 'ч': '000101', 'я': '000110', 'б': '000111', 'ь': '01000', 'п': '01001', 'м': '01010', 'в': '01011', 'к': '1000', 'р': '1001', 'а': '0110', 'л': '0111', 'т': '0010', 'н': '0011', 'о': '101', 'и': '110', 'е': '111'}
ans = ""
for let in st:
    ans += code.get(let, "")
print(ans)